In [1]:
#We now look at a method to perform data cleaning i.e. removing duplicate values from a dataframe

import pandas as pd
from pandas import DataFrame
import numpy as np

In [4]:
#Consider a dataframe with duplicate values
data = DataFrame({'A': ['one'] * 4 + ['two']*3, 'B':[1,1,2,3,3,4,4]})

In [5]:
data

     A  B
0  one  1
1  one  1
2  one  2
3  one  3
4  two  3
5  two  4
6  two  4

In [6]:
#DataFrame has a method duplicated which returns a boolean series of whether the item is a duplicate or not
data.duplicated()

0    False
1     True
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [7]:
#Using drop_duplicates we can remove these duplicates from the Dataframe
data.drop_duplicates()

     A  B
0  one  1
2  one  2
3  one  3
4  two  3
5  two  4

In [8]:
#Suppose we want to drop duplicates based on a particular column, then we can pass that column as a list to the method
data.drop_duplicates(['A'])

     A  B
0  one  1
4  two  3

In [12]:
#In case of dropping, if we want the last combination of the duplicate values rathar than the first combination which is by default then we can give keep argument last value

data.drop_duplicates(keep='last')

     A  B
1  one  1
2  one  2
3  one  3
4  two  3
6  two  4